GAULAvionique2024-2025/Ordinateur-de-bord/ODB_V3/Software/STM32CubeIDE/ODBlix/Core/Src/GAUL_Drivers/adxl382.c
/***************************************************************************//**
 *   @file   adxl38x.c
 *   @brief  Implementation of ADXL38X Driver.
 *   @author Balarupini Rajendran (balarupini.rajendran@analog.com)
********************************************************************************
 * Copyright 2024(c) Analog Devices, Inc.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. Neither the name of Analog Devices, Inc. nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY ANALOG DEVICES, INC. “AS IS” AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO
 * EVENT SHALL ANALOG DEVICES, INC. BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*******************************************************************************/

#include <stdlib.h>
#include <errno.h>
#include "stm32f4xx_hal.h"
#include "GAUL_Drivers/adxl382.h"
#include "GAUL_Drivers/no_os_util.h"


static const uint8_t adxl38x_scale_mul[3] = {1, 2, 4};

static int64_t adxl38x_accel_conv(struct adxl38x_dev *dev, uint16_t raw_accel);
static int adxl38x_set_to_standby(struct adxl38x_dev *dev);

/***************************************************************************//**
 * @brief Reads from the device.
 *
 * @param dev          - The device structure.
 * @param base_address - Address of the base register.
 * @param size         - The number of bytes to be read and returned in read_data.
 * @param read_data    - The read data buffer
 *
 * @return ret         - Result of the reading procedure.
*******************************************************************************/
int adxl38x_read_device_data(struct adxl38x_dev *dev, uint8_t base_address,
			     uint16_t size, uint8_t *read_data)
{
	return HAL_I2C_Mem_Read(dev->i2c, dev->addr, base_address, I2C_MEMADD_SIZE_8BIT, read_data, size, HAL_MAX_DELAY);
}

/***************************************************************************//**
 * @brief Writes to the device
 *
 * @param dev          - The device structure.
 * @param base_address - Address of the base register.
 * @param size         - The number of bytes to be written. It is the size
 *                       of the write_data buffer.
 * @param write_data   - The data which is going to be written.
 *
 * @return ret         - Result of the writing procedure.
*******************************************************************************/
int adxl38x_write_device_data(struct adxl38x_dev *dev, uint8_t base_address,
			      uint16_t size, uint8_t *write_data)
{

	uint16_t idx;

	dev->comm_buff[0] = base_address;
	for (idx = 0; idx < size; idx++)
		dev->comm_buff[1 + idx] = write_data[idx];

	return HAL_I2C_Mem_Write(dev->i2c, dev->addr, base_address, I2C_MEMADD_SIZE_8BIT, write_data, size, HAL_MAX_DELAY);
}

/***************************************************************************//**
 * @brief Updates register with specified bits using given mask
 *
 * @param dev          	- The device structure.
 * @param reg_addr 		- Address of the register to update.
 * @param mask         	- Mask for the update field.
 * @param update_val   	- Value to be updated.
 *
 * @return ret         	- Result of the writing procedure.
*******************************************************************************/
int adxl38x_register_update_bits(struct adxl38x_dev *dev, uint8_t reg_addr,
				 uint8_t mask,
				 uint8_t update_val)
{
	int ret;
	uint8_t data;

	ret = adxl38x_read_device_data(dev, reg_addr, 1, &data);
	if (ret)
		return ret;

	// Handle case where the OP_MODE register is accessed. Needs to go to
	// standby before changing any bits of the register. Needed for a safe
	// transition.
	if (reg_addr == ADXL38X_OP_MODE)
		adxl38x_set_to_standby(dev);

	data &= ~mask;
	data |= update_val;

	return adxl38x_write_device_data(dev, reg_addr, 1, &data);
}

/***************************************************************************//**
 * @brief Initializes the device and checks for valid peripheral communication
 *
 * @param device        - The device structure.
 * @param init_param 	- Structure containing initialization parameters
 *
 * @return ret         	- Result of the initialization
*******************************************************************************/
int adxl38x_init(struct adxl38x_dev **device)
{
	struct adxl38x_dev *dev;
	int ret;
	uint8_t reg_value;

	dev = (struct adxl38x_dev *)calloc(1, sizeof(*dev));
	if (!dev)
		return -ENOMEM;



	ret = adxl38x_read_device_data(dev, ADXL38X_DEVID_AD,
				       1, &reg_value);
	if (ret)
		goto error_com;
	if (reg_value != ADXL38X_RESET_DEVID_AD) {
		ret = -EINVAL;
		goto error_com;
	}

	ret = adxl38x_read_device_data(dev, ADXL38X_DEVID_MST,
				       1, &reg_value);
	if (ret)
		goto error_com;
	if (reg_value != ADXL38X_RESET_DEVID_MST) {
		ret = -EINVAL;
		goto error_com;
	}

	ret = adxl38x_read_device_data(dev, ADXL38X_PART_ID,
				       1, &reg_value);
	if (ret)
		goto error_com;
	if (reg_value != ADXL38X_RESET_PART_ID) {
		ret = -EINVAL;
		goto error_com;
	}

	/* Set device type 380/382 */
	ret = adxl38x_read_device_data(dev, ADXL38X_MISC0,
				       1, &reg_value);
	if (ret)
		goto error_com;


	/* Set default values to the device structure */
	dev->range = ADXL380_RANGE_4G;
	dev->op_mode = ADXL38X_MODE_STDBY;
	*device = dev;

