GAULAvionique2024-2025/Ordinateur-de-bord/ODB_V3/Software/STM32CubeIDE/ODBlix/Core/Src/GAUL_Drivers/adxl382.c
	return 0;

error_com:
	HAL_I2C_DeInit(dev->i2c);

	free(dev);
	return ret;

}

/***************************************************************************//**
 * @brief Free the resources allocated by the init function.
 *
 * @param dev  - The device structure.
 *
 * @return ret - Result of the remove procedure.
*******************************************************************************/
int adxl38x_remove(struct adxl38x_dev *dev)
{
	int ret;

	ret = HAL_I2C_DeInit(dev->i2c);

	free(dev);

	return ret;
}

/***************************************************************************//**
 * @brief Performs a soft reset of the device.
 *
 * @param dev  - The device structure.
 *
 * @return ret - Result of the soft reset procedure.
*******************************************************************************/
int adxl38x_soft_reset(struct adxl38x_dev *dev)
{
	uint8_t reg_value;
	int ret;
	uint8_t data = ADXL38X_RESET_CODE;

	// Perform soft reset
	ret = adxl38x_write_device_data(dev, ADXL38X_REG_RESET, 1, &data);
	if (ret)
		return ret;
	// Delay is needed between soft reset and initialization (From SOFT_RESET
	// bit description in REG_RESET)
	HAL_Delay(1);
	ret = adxl38x_read_device_data(dev, ADXL38X_DEVID_AD, 1, &reg_value);
	if (reg_value != 0xAD)
		return -EAGAIN;

	return 0;
}

/***************************************************************************//**
 * @brief Places the device into the given operation mode.
 *
 * @param dev     - The device structure.
 * @param op_mode - Operation mode mode.
 *
 * @return ret    - Result of the setting operation procedure.
*******************************************************************************/
int adxl38x_set_op_mode(struct adxl38x_dev *dev, enum adxl38x_op_mode op_mode)
{
	int ret;

	ret = adxl38x_register_update_bits(dev, ADXL38X_OP_MODE,
					   ADXL38X_MASK_OP_MODE,
					   no_os_field_prep(ADXL38X_MASK_OP_MODE, op_mode));
	if (!ret)
		dev->op_mode = op_mode;
	// 2ms wait for op_mode to settle (See Operating Modes section of datasheet)
	HAL_Delay(2);

	return ret;
}

/***************************************************************************//**
 * @brief Gets the current operation mode of the device
 *
 * @param dev     - The device structure.
 * @param op_mode - Read operation mode.
 *
 * @return ret    - Result of the reading operation procedure.
*******************************************************************************/
int adxl38x_get_op_mode(struct adxl38x_dev *dev, enum adxl38x_op_mode *op_mode)
{
	int ret;
	uint8_t op_mode_reg_val;

	ret = adxl38x_read_device_data(dev, ADXL38X_OP_MODE, 1, &op_mode_reg_val);
	if (ret)
		return ret;
	*op_mode = no_os_field_get(ADXL38X_MASK_OP_MODE, op_mode_reg_val);

	if (!ret)
		dev->op_mode = *op_mode;

	return 0;
}

/***************************************************************************//**
 * @brief Sets the measurement range register value.
 *
 * @param dev       - The device structure.
 * @param range_val - Selected range.
 *
 * @return ret      - Result of the writing procedure.
*******************************************************************************/
int adxl38x_set_range(struct adxl38x_dev *dev, enum adxl38x_range range_val)
{
	int ret;

	ret = adxl38x_register_update_bits(dev, ADXL38X_OP_MODE,
					   ADXL38X_MASK_RANGE,
					   no_os_field_prep(ADXL38X_MASK_RANGE, range_val));
	if (!ret)
		dev->range = range_val;

	return ret;
}

/***************************************************************************//**
 * @brief Gets the current range setting of the device
 *
 * @param dev       - The device structure.
 * @param range_val - Read range.
 *
 * @return ret    	- Result of the reading operation procedure.
*******************************************************************************/
int adxl38x_get_range(struct adxl38x_dev *dev, enum adxl38x_range *range_val)
{
	int ret;
	uint8_t range_reg_val;

	ret = adxl38x_read_device_data(dev, ADXL38X_OP_MODE, 1, &range_reg_val);
	if (ret)
		return ret;
	*range_val = no_os_field_get(ADXL38X_MASK_RANGE, range_reg_val);

	if (!ret)
		dev->range = *range_val;

	return 0;
}

/***************************************************************************//**
 * NOTE: It is recommended that the ADXL380 self-test should be performed in mid
 * and high gee ranges and in high power mode.
 * @brief Sets the part to execute self-test routine
 *
 * @param dev  		- The device structure.
 * @param st_mode 	- Enable/disable bit for self test.
 * @param st_force 	- Enable/disable bit for forced self test.
 * @param st_dir 	- Direction bit for self test. 0 - Forward, 1 - Reverse.
 *
 * @return ret 		- Result of the writing procedure.
*******************************************************************************/
int adxl38x_set_self_test_registers(struct adxl38x_dev *dev, bool st_mode,
				    bool st_force, bool st_dir)
{
	int ret;
	uint8_t st_fields_value = 0;

	if (st_mode)
		st_fields_value |= NO_OS_BIT(7);
	if (st_force)
		st_fields_value |= NO_OS_BIT(6);
	if (st_dir)
		st_fields_value |= NO_OS_BIT(5);

	ret = adxl38x_register_update_bits(dev, ADXL38X_SNSR_AXIS_EN,
					   ADXL38X_SLF_TST_CTRL_MSK, st_fields_value);

	return ret;
}

/***************************************************************************//**
 * NOTE: It is recommended that the ADXL380 self-test should be performed in mid
 * and high gee ranges and in high power mode.
 * @brief Resets the self test registers for the part.
 *
 * @param dev  - The device structure.
 *
 * @return ret - Result of the writing procedure.
*******************************************************************************/
int adxl38x_clear_self_test_registers(struct adxl38x_dev *dev)
{
	int ret;

	ret = adxl38x_register_update_bits(dev, ADXL38X_SNSR_AXIS_EN,
					   ADXL38X_SLF_TST_CTRL_MSK, ADXL38X_RESET_ZERO);

	return ret;
}

/***************************************************************************//**
 * TODO: Update according to datasheet (Currently based on RevH)
 * @brief Reads the status registers
 *
 * @param dev          - The device structure.
 * @param status_flags - Combined Status value.
 *
 * @return ret         - 32-bit status value as a combination of status 0 to 3
 * 						 registers.
*******************************************************************************/
int adxl38x_get_sts_reg(struct adxl38x_dev *dev,
			union adxl38x_sts_reg_flags *status_flags)
{
	int ret;
	uint8_t status_value[4];

	ret = adxl38x_read_device_data(dev, ADXL38X_STATUS0, 4, status_value);
	if (ret)
		return ret;
	status_flags->value = no_os_get_unaligned_be32(status_value);

