GAULAvionique2024-2025/Ordinateur-de-bord/ODB_V3/Software/STM32CubeIDE/ODBlix/Core/Src/GAUL_Drivers/adxl382.c
	return 0;
}

/***************************************************************************//**
 * @brief Reads the raw output data using continuous read.
 *
 * @param dev   - The device structure.
 * @param raw_x - X-axis's raw output data.
 * @param raw_y - Y-axis's raw output data.
 * @param raw_z - Z-axis's raw output data.
 *
 * @return ret  - Result of the reading procedure.
*******************************************************************************/
int adxl38x_get_raw_xyz(struct adxl38x_dev *dev, uint16_t *raw_x,
			uint16_t *raw_y, uint16_t *raw_z)
{
	int ret;
	uint8_t array_raw_data[6] = {0};
	uint8_t op_mode;

	// Enable XYZ channels
	ret = adxl38x_register_update_bits(dev, ADXL38X_DIG_EN,
					   ADXL38X_MASK_CHEN_DIG_EN,
					   no_os_field_prep(ADXL38X_MASK_CHEN_DIG_EN, ADXL38X_CH_EN_XYZ));
	if (ret)
		return ret;

	// Put part in measurement mode if not placed in any measurement mode
	ret = adxl38x_get_op_mode(dev, &op_mode);
	if (ret)
		return ret;
	if (op_mode == 0) {
		adxl38x_set_op_mode(dev, ADXL38X_MODE_HP);
	}

	// Read accel data channels
	ret = adxl38x_read_device_data(dev, ADXL38X_XDATA_H, 6, array_raw_data);
	if (ret)
		return ret;
	*raw_x = no_os_get_unaligned_be16(array_raw_data);
	*raw_y = no_os_get_unaligned_be16(array_raw_data + 2);
	*raw_z = no_os_get_unaligned_be16(array_raw_data + 4);

	return 0;
}

/***************************************************************************//**
 * @brief Reads the raw temperature data using burst read.
 *
 * @param dev   		- The device structure.
 * @param temp_degC 	- Temperature data in degree Celcius
 *
 * @return ret  	- Result of the reading procedure.
*******************************************************************************/
int adxl38x_get_temp(struct adxl38x_dev *dev,
		     struct adxl38x_fractional_val *temp_degC)
{
	int ret;
	uint8_t op_mode;
	uint8_t array_raw_data[2] = {0};

	// Enable T channel only
	ret = adxl38x_register_update_bits(dev, ADXL38X_DIG_EN,
					   ADXL38X_MASK_CHEN_DIG_EN,
					   no_os_field_prep(ADXL38X_MASK_CHEN_DIG_EN, ADXL38X_CH_EN_T));
	if (ret)
		return ret;

	// Put part in measurement mode if not placed in any measurement mode
	ret = adxl38x_get_op_mode(dev, &op_mode);
	if (ret)
		return ret;
	if (op_mode == 0) {
		adxl38x_set_op_mode(dev, ADXL38X_MODE_HP);
	}

	//Read accel temperature channel
	ret = adxl38x_read_device_data(dev, ADXL38X_TDATA_H, 2, array_raw_data);
	if (ret)
		return ret;
	temp_degC->integer = no_os_get_unaligned_be16(array_raw_data) >> 4;

	//LSB to C conversion
	temp_degC->integer = temp_degC->integer - ADXL38X_TEMP_OFFSET;
	temp_degC->fractional = (temp_degC->integer * ADXL38X_TEMP_SCALE_DEN) %
				ADXL38X_TEMP_SCALE_NUM;
	temp_degC->integer = (temp_degC->integer * ADXL38X_TEMP_SCALE_DEN) /
			     ADXL38X_TEMP_SCALE_NUM;

	return ret;
}

/***************************************************************************//**
 * @brief Reads the raw output data using burst read.
 *
 * @param dev   	- The device structure.
 * @param channels 	- Channels to enable.
 * @param raw_x 	- X-axis's raw output data.
 * @param raw_y 	- Y-axis's raw output data.
 * @param raw_z 	- Z-axis's raw output data.
 * @param raw_temp 	- Raw temp output data.
 *
 * @return ret  	- Result of the reading procedure.
*******************************************************************************/
int adxl38x_get_raw_data(struct adxl38x_dev *dev,
			 enum adxl38x_ch_select channels,
			 uint16_t *raw_x, uint16_t *raw_y,
			 uint16_t *raw_z, uint16_t *raw_temp)
{
	uint8_t array_raw_data[8] = {0};
	uint8_t array_rearranged_data[8] = {0};
	int ret;
	int j = 0;
	uint8_t op_mode;
	uint8_t tzyx, start_addr;
	uint16_t num_bytes = 0;

	// Enable given channel(s)
	ret = adxl38x_register_update_bits(dev, ADXL38X_DIG_EN,
					   ADXL38X_MASK_CHEN_DIG_EN,
					   no_os_field_prep(ADXL38X_MASK_CHEN_DIG_EN, channels));
	if (ret)
		return ret;

	// Put part in measurement mode if not placed in any measurement mode
	ret = adxl38x_get_op_mode(dev, &op_mode);
	if (ret)
		return ret;
	if (op_mode == 0) {
		adxl38x_set_op_mode(dev, ADXL38X_MODE_HP);
	}

	//Find the channels and number of bytes to read
	tzyx = (uint8_t)channels;
	if (tzyx & 0x01) {
		start_addr = ADXL38X_XDATA_H;
	} else if (tzyx & 0x02) {
		start_addr = ADXL38X_YDATA_H;
	} else if (tzyx & 0x04) {
		start_addr = ADXL38X_ZDATA_H;
	} else {
		start_addr = ADXL38X_TDATA_H;
	}
	while (tzyx) {
		num_bytes += tzyx & 0x01;
		tzyx >>= 1;
	}
	num_bytes = num_bytes * 2;

	//Read accel data channels
	ret = adxl38x_read_device_data(dev, start_addr, num_bytes, array_raw_data);
	if (ret)
		return ret;
	//Re-assign raw data to corresponding channels
	tzyx = (uint8_t)channels;
	for (int i = 0; i <  8; i += 2) {
		if (tzyx & 0x01) {
			array_rearranged_data[i] = array_raw_data[j];
			array_rearranged_data[i + 1] = array_raw_data[j + 1];
			j += 2;
		} else {
			array_rearranged_data[i] = 0;
			array_rearranged_data[i + 1] = 0;
		}
		tzyx >>= 1;
	}
	if (raw_x)
		*raw_x = no_os_get_unaligned_be16(array_rearranged_data);
	if (raw_y)
		*raw_y = no_os_get_unaligned_be16(array_rearranged_data + 2);
	if (raw_z)
		*raw_z = no_os_get_unaligned_be16(array_rearranged_data + 4);
	if (raw_temp)
		*raw_temp = no_os_get_unaligned_be16(array_rearranged_data + 6) >> 4;

	return ret;
}

/***************************************************************************//**
 * @brief Reads the raw output data of each axis and converts it to g.
 *
 * @param dev  		- The device structure.
 * @param channels 	- Channels to enable.
 * @param x    		- X-axis's output data.
 * @param y    		- Y-axis's output data.
 * @param z    		- Z-axis's output data.
 *
 * @return ret 		- Result of the reading procedure.
*******************************************************************************/
int adxl38x_get_xyz_gees(struct adxl38x_dev *dev,
			 enum adxl38x_ch_select channels,
			 struct adxl38x_fractional_val *x, struct adxl38x_fractional_val *y,
			 struct adxl38x_fractional_val *z)
{
	int ret;
	uint16_t raw_accel_x;
	uint16_t raw_accel_y;
	uint16_t raw_accel_z;

