GAULAvionique2024-2025/Ordinateur-de-bord/ODB_V3/Software/STM32CubeIDE/ODBlix/Core/Src/GAUL_Drivers/adxl382.c
	ret = adxl38x_get_raw_data(dev, channels, &raw_accel_x, &raw_accel_y,
				   &raw_accel_z, NULL);
	if (ret)
		return ret;

	x->integer = no_os_div_s64_rem((int64_t)adxl38x_accel_conv(dev, raw_accel_x),
				       ADXL38X_ACC_SCALE_FACTOR_GEE_DIV, &(x->fractional));
	y->integer = no_os_div_s64_rem((int64_t)adxl38x_accel_conv(dev, raw_accel_y),
				       ADXL38X_ACC_SCALE_FACTOR_GEE_DIV, &(y->fractional));
	z->integer = no_os_div_s64_rem((int64_t)adxl38x_accel_conv(dev, raw_accel_z),
				       ADXL38X_ACC_SCALE_FACTOR_GEE_DIV, &(z->fractional));

	return ret;
}

/***************************************************************************//**
 * @brief Converts raw acceleration value to m/s^2 value.
 *
 * @param dev       - The device structure.
 * @param raw_accel - Raw acceleration value.
 *
 * @return ret      - Converted data.
*******************************************************************************/
static int64_t adxl38x_accel_conv(struct adxl38x_dev *dev,
				  uint16_t raw_accel)
{
	int32_t accel_data;

	// Raw acceleration is in two's complement
	// Convert from two's complement to int
	if (raw_accel & NO_OS_BIT(15))
		accel_data = raw_accel | ADXL38X_NEG_ACC_MSK;
	else
		accel_data = raw_accel;


	return ((int64_t)(accel_data * ADXL382_ACC_SCALE_FACTOR_GEE_MUL *
			  adxl38x_scale_mul[dev->range]));

}

/***************************************************************************//**
 * @brief Puts the part in a safe state before setting important register values.
 *
 * @param dev       - The device structure.
 *
 * @return ret      - Result of setting to stanby mode.
*******************************************************************************/
static int adxl38x_set_to_standby(struct adxl38x_dev *dev)
{
	int ret;
	uint8_t op_mode_reg_val;

	ret = adxl38x_read_device_data(dev, ADXL38X_OP_MODE, 1, &op_mode_reg_val);
	// Applying mask sets underlying op_mode to standby (0)
	op_mode_reg_val = (op_mode_reg_val & ~ADXL38X_MASK_OP_MODE);
	ret |= adxl38x_write_device_data(dev, ADXL38X_OP_MODE,
					 1, &op_mode_reg_val);
	if (!ret)
		dev->op_mode = no_os_field_get(ADXL38X_MASK_OP_MODE, op_mode_reg_val);

	return ret;
}

/***************************************************************************//**
 * @brief Executed Selftest on the sensing axes and returns the outcome of
 * the test.
 *
 * @param dev   	- The device structure.
 * @param op_mode  - Operation mode in which self-test is executed
 * @param st_x 		- Result of X-axis self test success/failure
 * @param st_y 		- Result of X-axis self test success/failure
 * @param st_z 		- Result of X-axis self test success/failure
 *
 * @return ret  	- Outcome of the selftest.
*******************************************************************************/
int adxl38x_selftest(struct adxl38x_dev *dev, enum adxl38x_op_mode op_mode,
		     bool *st_x, bool *st_y, bool *st_z)
{
	int ret;
	uint8_t array_raw_data[6] = {0};
	int32_t low_limit_xy, low_limit_z;
	int32_t up_limit_xy, up_limit_z;
	int32_t st_delta_data[3] = {0};
	int32_t st_positive_data[3] = {0};
	int32_t st_negative_data[3] = {0};
	int64_t x_sum = 0;
	int64_t y_sum = 0;
	int64_t z_sum = 0;
	*st_x = false;
	*st_y = false;
	*st_z = false;

	/* Enter standby mode */
	ret = adxl38x_set_op_mode(dev, ADXL38X_MODE_STDBY);

	/* Enable desired channels (except temperature) */
	if (op_mode == ADXL38X_MODE_HRT_SND) {
		// Only one axis
		ret = adxl38x_register_update_bits(dev, ADXL38X_DIG_EN,
						   ADXL38X_MASK_CHEN_DIG_EN,
						   no_os_field_prep(ADXL38X_MASK_CHEN_DIG_EN, ADXL38X_CH_EN_X));
	} else {
		ret = adxl38x_register_update_bits(dev, ADXL38X_DIG_EN,
						   ADXL38X_MASK_CHEN_DIG_EN,
						   no_os_field_prep(ADXL38X_MASK_CHEN_DIG_EN, ADXL38X_CH_EN_XYZ));
	}
	if (ret)
		return ret;

	/* Enable desired OP mode */
	ret = adxl38x_set_op_mode(dev, op_mode);
	if (ret)
		return ret;

	/* Enable ST mode, force and positive direction */
	ret = adxl38x_set_self_test_registers(dev, true, true, false);
	if (ret)
		return ret;

	/* Measure output on all three axes for at least 25 samples and compute average*/
	for (int k = 0; k < 25; k++) {
		HAL_Delay(10);
		ret = adxl38x_read_device_data(dev, ADXL38X_XDATA_H, 6, array_raw_data);

		x_sum += (int64_t)(no_os_get_unaligned_be16(array_raw_data));
		y_sum += (int64_t)(no_os_get_unaligned_be16(array_raw_data + 2));
		z_sum += (int64_t)(no_os_get_unaligned_be16(array_raw_data + 4));
	}
	st_positive_data[0] = no_os_sign_extend32(no_os_div_s64(x_sum, 25), 15);
	st_positive_data[1] = no_os_sign_extend32(no_os_div_s64(y_sum, 25), 15);
	st_positive_data[2] = no_os_sign_extend32(no_os_div_s64(z_sum, 25), 15);

	/* Enable ST mode, force and negative direction */
	ret = adxl38x_set_self_test_registers(dev, true, true, true);
	if (ret)
		return ret;

	/* Measure output on all three axes for at lest 25 samples and compute average*/
	x_sum = 0;
	y_sum = 0;
	z_sum = 0;
	for (int k = 0; k < 25; k++) {
		HAL_Delay(10);
		ret = adxl38x_read_device_data(dev, ADXL38X_XDATA_H, 6, array_raw_data);

		x_sum += (int64_t)(no_os_get_unaligned_be16(array_raw_data));
		y_sum += (int64_t)(no_os_get_unaligned_be16(array_raw_data + 2));
		z_sum += (int64_t)(no_os_get_unaligned_be16(array_raw_data + 4));
	}
	st_negative_data[0] = no_os_sign_extend32(no_os_div_s64(x_sum, 25), 15);
	st_negative_data[1] = no_os_sign_extend32(no_os_div_s64(y_sum, 25), 15);
	st_negative_data[2] = no_os_sign_extend32(no_os_div_s64(z_sum, 25), 15);

	/* Compute self-test delta */
	// Multiply self test denomitator for the values to be comparable
	for (int k = 0; k < 3; k++) {
		st_delta_data[k] = (int32_t) abs(st_positive_data[k] - st_negative_data[k]);
		st_delta_data[k] = st_delta_data[k] * ADXL38X_ST_LIMIT_DENOMINATOR;
	}

	/* Compare self-test delta magnitude with Datasheet values */
	// Apply scale factor based on the selected range

	low_limit_xy = (ADXL382_XY_ST_LIMIT_MIN * ADXL382_ACC_SENSITIVITY) >>
			   (dev->range);
	up_limit_xy = (ADXL382_XY_ST_LIMIT_MAX * ADXL382_ACC_SENSITIVITY) >>
			  (dev->range);
	low_limit_z = (ADXL382_Z_ST_LIMIT_MIN * ADXL382_ACC_SENSITIVITY) >>
			  (dev->range);
	up_limit_z = (ADXL382_Z_ST_LIMIT_MAX * ADXL382_ACC_SENSITIVITY) >> (dev->range);



	if (st_delta_data[0] >= low_limit_xy && st_delta_data[0] <= up_limit_xy)
		*st_x = true;
	if (st_delta_data[1] >= low_limit_xy && st_delta_data[1] <= up_limit_xy)
		*st_y = true;
	if (st_delta_data[2] >= low_limit_z && st_delta_data[2] <= up_limit_z)
		*st_z = true;

	/* Reset ST bits */
	ret = adxl38x_set_self_test_registers(dev, false, false, false);
	if (ret)
		return ret;

