GAULAvionique2024-2025/Ordinateur-de-bord/ODB_V3/Software/STM32CubeIDE/ODBlix/Core/Src/GAUL_Drivers/adxl382.c
	return 0;
}

/***************************************************************************//**
 * @brief Function to set the paramenters for FIFO mode
 *
 * @param dev        		- The device structure.
 * @param num_samples 		- Number of FIFO entries that FIFI_WATERMARK should set.
 * @param external_trigger 	- Enable/disable external trigger in FIFO stream mode.
 * @param fifo_mode        	- FIFO mode setting.
 * @param ch_ID_enable      - Enable/disable channel ID.
 * @param read_reset       	- reset read/write point and read state machine.
 *
 * @return ret      		- Result of the procedure.
*******************************************************************************/
int adxl38x_accel_set_FIFO(struct adxl38x_dev *dev, uint16_t num_samples,
			   bool external_trigger, enum adxl38x_fifo_mode fifo_mode, bool ch_ID_enable,
			   bool read_reset)
{
	int ret;
	uint8_t write_data = 0;
	uint8_t fifo_samples_low;
	uint8_t fifo_samples_high;
	uint8_t set_channels;

	// Obtain the channels enabled in DIG_EN register
	ret = adxl38x_read_device_data(dev, ADXL38X_DIG_EN, 1, &set_channels);
	if (ret)
		return ret;
	set_channels = no_os_field_get(ADXL38X_MASK_CHEN_DIG_EN, set_channels);

	// Check if number of samples provided is allowed
	if (num_samples > 320)
		return -EINVAL;
	else if ((num_samples > 318) &&
		 ((!set_channels) || (set_channels == ADXL38X_CH_EN_XYZ) ||
		  (set_channels == ADXL38X_CH_EN_YZT)))
		return -EINVAL;

	// set FIFO_CFG1 register
	fifo_samples_low = (uint8_t) num_samples & 0xFF;
	ret = adxl38x_write_device_data(dev, ADXL38X_FIFO_CFG1, 1, &fifo_samples_low);
	if (ret)
		return ret;

	// building data for FIFO_CFG0 register
	fifo_samples_high = (uint8_t) num_samples >> 8;
	fifo_samples_high = fifo_samples_high & NO_OS_BIT(0);
	write_data = fifo_samples_high;

	fifo_mode = no_os_field_prep(ADXL38X_FIFOCFG_FIFOMODE_MSK, fifo_mode);
	write_data |= fifo_mode;

	if (read_reset)
		write_data |= NO_OS_BIT(7);

	if (ch_ID_enable)
		write_data |= NO_OS_BIT(6);

	if (external_trigger && fifo_mode == ADXL38X_FIFO_TRIGGER)
		write_data |= NO_OS_BIT(3);

	ret = adxl38x_write_device_data(dev, ADXL38X_FIFO_CFG0, 1, &write_data);

	return ret;
}

/***************************************************************************//**
 * @brief Function to convert accel data to gees
 *
 * @param dev        		- The device structure.
 * @param raw_accel_data 	- Raw data array of two bytes
 * @param data_frac        	- Fractional data in gees
 *
 * @return ret      		- Result of the procedure.
*******************************************************************************/
int adxl38x_data_raw_to_gees(struct adxl38x_dev *dev, uint8_t *raw_accel_data,
			     struct adxl38x_fractional_val *data_frac)
{
	uint16_t data = 0;

	data = no_os_get_unaligned_be16(raw_accel_data);
	data_frac->integer = no_os_div_s64_rem((int64_t)adxl38x_accel_conv(dev, data),
					       ADXL38X_ACC_SCALE_FACTOR_GEE_DIV, &(data_frac->fractional));

	return 0;
}
